In [1]:
import numpy as np
import pandas as pd

In [2]:
# create list

list1 = [1,2,3,4]
list2 = [-1,-2,-3,-4]
list3 = [ list1, list2  ]
print(list3)

[[1, 2, 3, 4], [-1, -2, -3, -4]]

In [3]:
# ar_list1 =  array("i", list1)  # doesnt work

In [4]:
# list to array

array1 = np.array(list1)
print(array1)

[1 2 3 4]

In [5]:
print(sum(array1))
print(array1[0])

10
1

In [6]:
dimArray = np.array( list3 )

In [7]:
print ( dimArray )

[[ 1  2  3  4]
 [-1 -2 -3 -4]]

In [8]:
print( dimArray[1][0] )

-1

In [9]:
#increrment all by 1
dimArray = dimArray +1

In [10]:
# list to series ( with default index )
print ( pd.Series(list1) )

# array to series also works 
print ( pd.Series(array1) )

0    1
1    2
2    3
3    4
dtype: int64
0    1
1    2
2    3
3    4
dtype: int32

In [11]:
# Series with explicit index
#print ( pd.Series(array1, index=['zero', 'one', 'two', 'three']) )

indexedSeries = pd.Series(array1, index=['zero', 'one', 'two', 'three'])

In [12]:
print(indexedSeries)

zero     1
one      2
two      3
three    4
dtype: int32

In [13]:


df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west']
)

In [14]:
print(df)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [15]:
# slice rows : these give the same output

print(df[1:3])
print(df.iloc[1:3])

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96
      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
2     March           81            96            65           96

In [16]:
# slice rows : these also give the same output

print(df[ 3: ])
print(df[ -3: ])

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129
   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [17]:
# try skip step 
## [ start : end : interval ] 

df[0:4:2] # doesnt work with a straight slice
#df.iloc[0:4]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96

In [18]:
# instruction

april_may_june = df[ 3: ]

april_may_june

   month  clinic_east  clinic_north  clinic_south  clinic_west
3  April           80            80            54          180
4    May           51            54            54          154
5   June          112           109            79          129

In [19]:
#########
## Select with conditions
###############

In [20]:
df = pd.DataFrame([
  ['January', 100, 100, 23, 100],
  ['February', 51, 45, 145, 45],
  ['March', 81, 96, 65, 96],
  ['April', 80, 80, 54, 180],
  ['May', 51, 54, 54, 154],
  ['June', 112, 109, 79, 129]],
  columns=['month', 'clinic_east',
           'clinic_north', 'clinic_south',
           'clinic_west'])

In [21]:
#df

In [22]:
# lambda refresher

f = lambda n : n * 5
f(3)

15

In [23]:
# select WHERE, single condition
# df[ df.column <op> condition ]

df[ df.clinic_east > 51 ]

     month  clinic_east  clinic_north  clinic_south  clinic_west
0  January          100           100            23          100
2    March           81            96            65           96
3    April           80            80            54          180
5     June          112           109            79          129

In [24]:
## instruction
# Create variable january using a logical statement that selects the row of df where the 'month' column is 'January'. 

january = df[ df.month ==  'January' ]

In [25]:
# select WHERE, multiple conditions
# df[  ( df.column <op> condition )  |/& ( df.column <op> condition ) ]
## * for more than 2 conditions, AND (&) is evaluated before OR (|)

In [26]:
## instruction
# Create the variable march_april, which contains the data from March and April. Do this using two logical statements combined using |, which means “or”.

march_april = df[ ( df.month == 'March' ) | ( df.month == 'April' ) ]

print(march_april)

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [27]:
# select WHERE, using ISIN

# df[df.<column>.isin([value, value, value])]

In [28]:
df[df.clinic_east.isin([80, 81])]

   month  clinic_east  clinic_north  clinic_south  clinic_west
2  March           81            96            65           96
3  April           80            80            54          180

In [29]:
## instruction
# Create the variable january_february_march, containing the data from January, February, and March. Do this using a single logical statement with the isin command.

january_february_march = df[df.month.isin(['January', 'February', 'March'])]

print(january_february_march)

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96

In [30]:
# Reset index on extracted slice

In [31]:
df[ df.clinic_east == 51 ]

# notice the index 1,4 is fragmented

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
4       May           51            54            54          154

In [32]:
df[ df.clinic_east == 51 ].reset_index()

# FIXED, sorta, though old values remain in a new column, index

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      4       May           51            54            54          154

In [33]:
df[ df.clinic_east == 51 ].reset_index( drop = True )  # drop = True removes the old index values

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1       May           51            54            54          154

In [34]:
# Note, both these operations create a new dataframe with the result set. 'df' is not effected.
#df

In [35]:
# use inplace=True to modify a dataframe in place

df[ df.clinic_east < 80 ].reset_index(inplace=True   )

In [36]:
df

      month  clinic_east  clinic_north  clinic_south  clinic_west
0   January          100           100            23          100
1  February           51            45           145           45
2     March           81            96            65           96
3     April           80            80            54          180
4       May           51            54            54          154
5      June          112           109            79          129

In [37]:
# New method :: loc[] to access rows
df.loc[[1, 3, 5]]

#df.loc[[1, 3, 5]].reset_index()

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [38]:
df2 = df.loc[[1, 3, 5]]
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
1  February           51            45           145           45
3     April           80            80            54          180
5      June          112           109            79          129

In [39]:
## instruction
# Create a new DataFrame called df3 by resetting the indices on df2 (don’t use inplace or drop). Did df2 change after you ran this command?

df3 = df2.reset_index()
df3

   index     month  clinic_east  clinic_north  clinic_south  clinic_west
0      1  February           51            45           145           45
1      3     April           80            80            54          180
2      5      June          112           109            79          129

In [40]:
# Reset the indices of df2 by using the keyword inplace=True and drop=True. Did the indices of df2 change? How is df2 different from df3?

df2.reset_index(drop=True, inplace=True)
df2

      month  clinic_east  clinic_north  clinic_south  clinic_west
0  February           51            45           145           45
1     April           80            80            54          180
2      June          112           109            79          129

In [41]:
###
#  Excursion : using reset_index() to force a numeric index on a df that has been indexed on another non-numeric column
####

df_networkProject = pd.read_csv('Nodes_IN_Medium.csv')

In [42]:
#type(df_networkProject)
df_networkProject.head(5)

,Id,Label,timeset,nodename,nodetype,nodereadiness,nodeproductioncapacity,nodeproduction,nodestorescapacity,nodestores,nodedamage,nodedamageapplied,nodestarvationapplied,nodeconversioncapacity,nodeconversion
0,1,NaN,NaN,cnsDistributor1,cnsDistributor,99,0,0,250.0,0,0,False,False,0,0
1,2,NaN,NaN,cnsDistributor2,cnsDistributor,99,0,0,250.0,0,0,False,False,0,0
2,3,NaN,NaN,consumer1,consumer,99,0,0,55.6,0,0,False,False,0,0
3,4,NaN,NaN,consumer2,consumer,99,0,0,55.6,0,0,False,False,0,0
4,5,NaN,NaN,consumer3,consumer,99,0,0,55.6,0,0,False,False,0,0

In [43]:
# set the df index to nodename

df_networkProject.set_index('nodename', inplace = True)

In [44]:
# now reset the index

df_networkProject.reset_index(inplace=True)

# WORKS!

In [45]:
####################
# Exercise
#################

#In this example, you’ll be the data analyst for ShoeFly.com, a fictional online shoe store. You’ve seen this data; now it’s your turn to work with it!

In [48]:
# Load the data from shoefly.csv into the variable orders 

orders = pd.read_csv('shoefly.csv')

In [49]:
# Inspect the first 5 lines of the data.

orders.head(5) # no good; Excel didnt parse it; its all in 1 column... FIXED

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
2,91987,Joyce,Waller,Joyce.Waller@gmail.com,sandals,fabric,black
3,14437,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,AB4318@gmail.com,boots,leather,brown

In [51]:
# Select all of the email addresses from the column email and save them to a variable called emails

orders['email']

0     RebeccaLindsay57@hotmail.com
1           EmilyJoyce25@gmail.com
2           Joyce.Waller@gmail.com
3      Justin.Erickson@outlook.com
4                 AB4318@gmail.com
5           JulieMarsh59@gmail.com
6                 TJ5470@gmail.com
7           Janice.Hicks@gmail.com
8        GabrielPorter24@gmail.com
9        FrancesPalmer50@gmail.com
10         JessicaHale25@gmail.com
11      LawrenceParker44@gmail.com
12         SusanDennis58@gmail.com
13                DO2680@gmail.com
14       Rebecca.Charles@gmail.com
15              JC2072@hotmail.com
16              VS4753@outlook.com
17          RoyTillman20@gmail.com
18       Thomas.Roberson@gmail.com
19         ANewton1977@outlook.com
Name: email, dtype: object

In [59]:
# Frances Palmer claims that her order was wrong. What did Frances Palmer order? Use logic to select that row of orders and save it to the variable frances_palmer

frances_palmer = orders[ ( orders.first_name  == 'Frances' ) & ( orders.last_name == 'Palmer'  )  ]
print(type(frances_palmer))  # even this single line result is of type data frame
frances_palmer

<class 'pandas.core.frame.DataFrame'>

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
9,62083,Frances,Palmer,FrancesPalmer50@gmail.com,wedges,leather,white

In [64]:
# We need some customer reviews for our comfortable shoes. Select all orders for shoe_type: clogs, boots, and ballet flats and save them to the variable comfy_shoes.

comfy_shoes = orders[ orders.shoe_type.isin(  [ 'clogs', 'boots', 'ballet flats' ] ) ]

print( comfy_shoes )
comfy_shoes

       id first_name   last_name                         email     shoe_type  \
0   54791    Rebecca     Lindsay  RebeccaLindsay57@hotmail.com         clogs
1   53450      Emily       Joyce        EmilyJoyce25@gmail.com  ballet flats
3   14437     Justin    Erickson   Justin.Erickson@outlook.com         clogs
4   79357     Andrew       Banks              AB4318@gmail.com         boots
6   20487     Thomas      Jensen              TJ5470@gmail.com         clogs
7   76971     Janice       Hicks        Janice.Hicks@gmail.com         clogs
8   21586    Gabriel      Porter     GabrielPorter24@gmail.com         clogs
10  91629    Jessica        Hale       JessicaHale25@gmail.com         clogs
12  45832      Susan      Dennis       SusanDennis58@gmail.com  ballet flats
14  73431    Rebecca     Charles     Rebecca.Charles@gmail.com         boots
16  39888    Vincent  Stephenson            VS4753@outlook.com         boots
17  35961        Roy     Tillman        RoyTillman20@gmail.com         boots

   shoe_material shoe_color
0   faux-leather      black
1   faux-leather       navy
3   faux-leather        red
4        leather      brown
6         fabric       navy
7   faux-leather       navy
8        leather      brown
10       leather        red
12        fabric      white
14  faux-leather      white
16       leather      black
17       leather      white

,id,first_name,last_name,email,shoe_type,shoe_material,shoe_color
0,54791,Rebecca,Lindsay,RebeccaLindsay57@hotmail.com,clogs,faux-leather,black
1,53450,Emily,Joyce,EmilyJoyce25@gmail.com,ballet flats,faux-leather,navy
3,14437,Justin,Erickson,Justin.Erickson@outlook.com,clogs,faux-leather,red
4,79357,Andrew,Banks,AB4318@gmail.com,boots,leather,brown
6,20487,Thomas,Jensen,TJ5470@gmail.com,clogs,fabric,navy
7,76971,Janice,Hicks,Janice.Hicks@gmail.com,clogs,faux-leather,navy
8,21586,Gabriel,Porter,GabrielPorter24@gmail.com,clogs,leather,brown
10,91629,Jessica,Hale,JessicaHale25@gmail.com,clogs,leather,red
12,45832,Susan,Dennis,SusanDennis58@gmail.com,ballet flats,fabric,white
14,73431,Rebecca,Charles,Rebecca.Charles@gmail.com,boots,faux-leather,white
16,39888,Vincent,Stephenson,VS4753@outlook.com,boots,leather,black
17,35961,Roy,Tillman,RoyTillman20@gmail.com,boots,leather,white